# \> Фильтры (1/2)
Отберите пользователей старше 30 с устройством на iOS. Каков `ID` и `город` записи с минимальным ID (он идет первым в таблице)? Запишите значения через пробел.

In [4]:
import pandas as pd
from db_con import connection

sql_query = """
    select
        id
        , city
    from "user"
    where True
        and age > 30
        and os = 'iOS'
"""
df = pd.read_sql(
    sql_query,
    con=connection
)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17670 entries, 0 to 17669
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      17670 non-null  int64
 1   city    17670 non-null  object
dtypes: int64(1), object(1)
memory usage: 276.2+ KB

    id           city
0  212        Podolsk
1  222      Ulyanovsk
2  224  Yekaterinburg
3  226         Moscow
4  243      Ekibastuz

In [6]:
df.iloc[0]

id          212
city    Podolsk
Name: 0, dtype: object